[
  {
    "id": "1",
    "company": "CARD MRI",
    "companyUrl": "https://cardmri.com",
    "position": "Application Developer (Full Stack)",
    "location": "San Pablo Laguna, PH",
    "startDate": "2024-11",
    "isCurrent": true,
    "description": "Full stack developer supporting enterprise banking systems for CARD Bank, CARD SME Bank, and CARD RBI",
    "keyPoints": [
        "Develop and maintain Spring Boot–based Java applications for web platforms and mobile APIs.",
        "Migrate legacy databases and applications into modern architectures and technologies.",
        "Design, implement, and maintain Mobile APIs and Open APIs used by third-party services.",
        "Work with APIs that share a common core but implement institution-specific business logic and functions.",
        "Support Web APIs as needed, with primary focus on mobile-facing services.",
        "Use SQL Server Management",
        "Studio (SSMS) for legacy database operations and data analysis.",
        "Actively involved in migrating legacy databases to PostgreSQL and transitioning backend services from Java Spring Boot to Go (Golang) while continuing to enhance existing systems."
    ],
    "technologies": [
      "TypeScript",
      "Express.js",
      "Node.js",
      "Next.js",
      "Tailwind",
      "WordPress",
      "Shopify",
      "PostgreSQL",
      "MySQL",
      "Bitbucket"
    ]
  },
  {
    "id": "2",
    "company": "Ebizolution Inc",
    "companyUrl": "https://www.ebizolution.com",
    "position": "Service Engineer",
    "location": "Pasay City, Metro Manila, PH",
    "startDate": "2023-08",
    "endDate": "2024-03",
    "isCurrent": false,
    "description": "Optimized daily service operations by strategically managing and prioritizing technical appointments, ensuring high-priority issues were resolved with minimal downtime",
    "keyPoints": [
      "Managed and prioritized technical service appointments to support daily operations.",
      "Performed troubleshooting, repairs, and preventive maintenance to ensure optimal system performance.",
      "Configured and updated equipment settings to improve reliability and efficiency.", 
      "Applied best practices while operating within prescribed service and safety standards."
    ],
    "technologies": [
      "React.js",
      "Express.js",
      "Node.js",
      "Ant Design",
      "MySQL",
      "AWS Lambda",
      "AWS DynamoDB",
      "Git"
    ]
  },
   {
    "id": "3",
    "company": "Simplevia",
    "companyUrl": "https://www.simplevia.com",
    "position": "Full Stack Developer",
    "location": "Remote",
    "startDate": "2023-03",
    "endDate": "2023-05",
    "isCurrent": false,
    "description": "Streamlined application workflows by seamlessly integrating diverse internal and external data sources, improving data consistency across the platform.",
    "keyPoints": [
      "Translated functional requirements into scalable application components.",
      "Developed and enhanced backend services using Java and related technologies.",
      "Integrated internal and external data sources to support application workflows.",
      "Debugged and resolved software issues to improve performance, security, and usability."
    ],
    "technologies": [
      "HTML",
      "CSS",
      "JavaScript",
      "Vue.js",
      "WordPress"
    ]
  },
  {
    "id": "4",
    "company": "Self-employed",
    "position": "Freelance Web Developer",
    "location": "Remote",
    "startDate": "2018-01",
    "isCurrent": false,
    "description": "Delivered end-to-end web solutions for various clients, translating business workflows into scalable applications. Owned development, deployment, and CI/CD pipelines, while improving system performance, reliability, and long-term maintainability.",
    "keyPoints": [
      "Collaborated closely with clients to understand their technical workflows and deliver tailored, high-impact solutions.",
      "Led end-to-end development of the application and implemented a CI/CD pipeline to enable seamless, zero-downtime deployments.",
      "Identified and resolved critical system issues, improving performance, reliability, and overall feature scalability."
    ],
    "technologies": [
      "HTML",
      "CSS",
      "JavaScript",
      "Vue.js",
      "WordPress"
    ]
  }
]